[
  {
    "title": "cottonusa.org",
    "titleDetail": "COTTON USA Global Website",
    "href": "cotton-usa",
    "link": "//cottonusa.org",
    "description": "Our goal was to consolidate various country-specific Cotton sites into one global site translated across twelve languages. Knowing this, we did our best to communicate the challenges associated with multilingual sites to the Creative team. Craft CMS was chosen for it’s intuitive Control Panel and localization capabilities.\n\nPrior to this project I proposed a style and best practices guide to create a more efficient and sustainable workflow. By taking a more modular approach, we were able to reuse, modify, and remove components without the fear of breaking a component elsewhere. Though it wasn’t a perfect solution, it was a vast improvement on our previous workflow.\n\nI was responsible for developing a majority of the site’s components, as well as creating their respective fields in the CMS. I created a few Sass mixins and functions to address some of the multilingual challenges (for instance, handling left-to-right and right-to-left scripts). I also wrote a Twig macro to serve appropriately sized uploaded images with the image tag’s srcset attribute and Craft’s image transforms.\n\nAccessibility was of utmost importance to our client Cotton Council International. Since this was something I wanted to learn more about, I took on the challenge and did my best to create an as accessible site as I could. One of the biggest tasks was making the top navigation intuitive to a screen reader and keyboard user.",
    "type": "Website",
    "technologies": "Craft CMS, Twig, SASS(SCSS), JavaScript(ES6, jQuery), Gulp",
    "thumbnail": "cotton-usa/thumb/cotton-usa.jpg",
    "detailAssets": [
      {
        "type": "video",
        "width": "full-width",
        "src": "cotton-usa/homepage.mp4"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "cotton-usa/desktop/our-promise.jpg"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "cotton-usa/desktop/buyers-guide.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "cotton-usa/mobile/homepage.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "cotton-usa/mobile/menu.jpg"
      }
    ]
  },
  {
    "title": "theporschepanamera.com",
    "titleDetail": "Porsche Panamera Microsite",
    "href": "the-porsche-panamera",
    "link": "//theporschepanamera.com",
    "description": "Since there wasn’t a lot of content, the microsite relied heavily on interactions and animations to keep users invested in the experience. I was primarily responsible for the timeline section of the page. The biggest challenge was crafting the JavaScript heavy animations seen upon landing on the site and after clicking the ‘Explore 69 Years of Disruption’ button. GSAP’s TweenMax and TimelineMax were used create performant and smooth animations. Hammer.js allowed for the dragging and swiping of cars through the timeline. I also set up a SVG icon system for our team to use instead of icon fonts.",
    "type": "Website",
    "technologies": "Pug, GSAP, JavaScript(ES6, jQuery), SASS(SCSS), Gulp",
    "thumbnail": "panamera/thumb/panamera.jpg",
    "awards": [
      {
        "name": "Awwwards Site of the Day",
        "link": "//www.awwwards.com/sites/porsche-panamera"
      },
      {
        "name": "Commarts Webpick",
        "link": "//www.commarts.com/webpicks/the-new-panamera"
      }
    ],
    "detailAssets": [
      {
        "type": "image",
        "width": "full-width",
        "src": "panamera/desktop/home.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "panamera/desktop/356.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "panamera/desktop/race-bred-innovation.jpg"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "panamera/desktop/engine.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "panamera/mobile/home.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "panamera/mobile/911-turbo.jpg"
      }
    ]
  },
  {
    "title": "Brightline",
    "titleDetail": "Brightline Marketing Site",
    "href": "go-brightline",
    "description": "This site served as a hub for All Aboard Florida and Brightline rail progress and news. From the beginning, I was tasked with leading the design of the front-end architecture and development. I created modular components that could be reused throughout the site to increase our efficiency since this was a rather large job for a two-man team. A few JavaScript libraries were also used to speed up development. Because the content was managed by a number of people on the Brightline team, we had to ensure that the Admin panel was intuitive and accessible for the less technically inclined. It was decided that WordPress would be used since that was the CMS the client was most familiar with. A few plugins helped to create a user-friendly experience for the content managers. Behind the scenes, PHP was used to customize a number of plugins to best suit our needs. This was one of the first projects where I pushed for the use of SVGs for their performance and quality benefits. Shortly after launch, we migrated the site to WP Engine which provided some performance and security assistance.",
    "type": "Website",
    "technologies": "PHP, WordPress, WP Engine, JavaScript, Multiscroll.js, Fancybox.js, Modernizr, SASS(SCSS), Gulp, MailChimp",
    "thumbnail": "go-brightline/thumb/brightline.jpg",
    "detailAssets": [
      {
        "type": "image",
        "width": "full-width",
        "src": "go-brightline/desktop/home.jpg"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "go-brightline/desktop/miami.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "go-brightline/mobile/home.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "go-brightline/mobile/menu.jpg"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "go-brightline/desktop/progress.jpg"
      }
    ]
  },
  {
    "title": "thenew911.com",
    "titleDetail": "Porsche 911 Microsite",
    "href": "the-new-911",
    "link": "//thenew911.com",
    "description": "Shortly after kickoff, I started as an intern at C-K. With a brief, crash course introduction to the site’s architecture, I immediately began assisting our sole developer. After demonstrating my front-end abilities, I was tasked with building, styling, and testing the remaining pages. I focused on developing semantic, maintainable, and responsive components. Jade and Grunt were used to generate all of the static pages from the data provided in a JSON file. Various types of analytics tracking were also added.",
    "type": "Website",
    "technologies": "Jade, JavaScript(jQuery), SASS(SCSS), Foundation, Modernizr, Grunt",
    "thumbnail": "911/thumb/911.jpg",
    "detailAssets": [
      {
        "type": "image",
        "width": "full-width",
        "src": "911/desktop/home.jpg"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "911/desktop/detail.jpg"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "911/desktop/hologram.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "911/mobile/home.jpg"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "911/mobile/hologram.jpg"
      }
    ]
  },
  {
    "title": "Leo Burnett Internship",
    "titleDetail": "Leo Burnett Internship",
    "href": "leo-burnett",
    "description": "During my time at Leo Burnett Interactive, I developed, maintained and fixed defects on various websites for internal and client projects, including Allstate, ComEd and Marwen. One of my biggest responsibilities was developing the website for Leo Burnett’s 80th anniversary in collaboration with the two other interns. I was also exposed to various APIs, including Google Maps, YouTube, Vimeo, Facebook and Twitter.",
    "type": "Websites",
    "technologies": "SASS, JavaScript(jQuery), BoltCMS, Wordpress, Tumblr, Foundation, Grunt, SourceTree, Video.js",
    "thumbnail": "leo-burnett/thumb/leo-black-bg-min.png",
    "detailAssets": [
      {
        "type": "image",
        "width": "full-width",
        "src": "leo-burnett/comed-homepage-min.png"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "leo-burnett/comed-andstem-min.png"
      },
      {
        "type": "image",
        "width": "half-width",
        "src": "leo-burnett/comed-videos-min.png"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "leo-burnett/marwen-homepage-min.png"
      },
      {
        "type": "image",
        "width": "full-width",
        "src": "leo-burnett/marwen-installation-min.png"
      }
    ]
  }
]